const mapData = {
  "areas": [
    {
      "name": "نجد",
      "coordinates": [
        [
          29.898,
          43.022
        ],
        [
          29.114,
          45.461
        ],
        [
          25.978,
          48.164
        ],
        [
          22.309,
          48.889
        ],
        [
          20.838,
          48.01
        ],
        [
          21.923,
          44.648
        ],
        [
          27.781,
          41.99
        ],
        [
          29.898,
          43.022
        ]
      ]
    },
    {
      "name": "الحجاز",
      "coordinates": [
        [
          27.917,
          36.145
        ],
        [
          23.725,
          39.111
        ],
        [
          19.974,
          41.418
        ],
        [
          19.643,
          43.066
        ],
        [
          23.544,
          41.067
        ],
        [
          27.489,
          37.463
        ],
        [
          27.917,
          36.145
        ]
      ]
    },
    {
      "name": "السراة",
      "coordinates": [
        [
          15.369,
          44.868
        ],
        [
          13.86,
          44.868
        ],
        [
          14.094,
          43.792
        ],
        [
          19.145,
          41.748
        ],
        [
          20.407,
          40.979
        ],
        [
          20.921,
          41.396
        ],
        [
          15.369,
          44.868
        ]
      ]
    },
    {
      "name": "نجدف",
      "coordinates": [
        [
          24.50714328310284,
          44.76928710937501
        ],
        [
          23.56398712845123,
          40.82519531250001
        ],
        [
          26.116,
          38.8477
        ],
        [
          29.6881,
          39.2871
        ],
        [
          29.99300228455108,
          41.66015625000001
        ],
        [
          29.878755346037977,
          42.93457031250001
        ],
        [
          26.92206991673282,
          47.13134765625
        ]
      ]
    }
  ],
  "cities": [
    {
      "name": "الرياض",
      "coordinates": [
        24.7136,
        46.6753
      ],
      "type": "city",
      "population": "7.6 مليون"
    },
    {
      "name": "الحنو",
      "coordinates": [
        23.7136,
        46.6753
      ],
      "type": "city",
      "population": "7.6 مليون"
    },
    {
      "name": "مكة المكرمة",
      "coordinates": [
        21.4225,
        39.8262
      ],
      "type": "city",
      "population": "2.0 مليون"
    },
    {
      "name": "المدينة المنورة",
      "coordinates": [
        24.4672,
        39.6112
      ],
      "type": "city",
      "population": "1.5 مليون"
    },
    {
      "name": "جدة",
      "coordinates": [
        21.5433,
        39.1728
      ],
      "type": "city",
      "population": "4.1 مليون"
    },
    {
      "name": "الدمام",
      "coordinates": [
        26.4207,
        50.0888
      ],
      "type": "city",
      "population": "1.2 مليون"
    }
  ],
  "locations": [
    {
      "name": "مدائن صالح",
      "coordinates": [
        26.8088,
        37.9545
      ],
      "type": "historical"
    },
    {
      "name": "الدرعية التاريخية",
      "coordinates": [
        24.7442,
        46.5762
      ],
      "type": "historical"
    }
  ]
};